{"match_id": 1422119, "report_text": "Chennai Super Kings clinched a thrilling 6-wicket win over Royal Challengers Bengaluru in the IPL 2024 opener, chasing down 179 with 5 balls to spare. \n\nA 95-run stand between Ruturaj Gaikwad and Devon Conway steadied CSK after an early wicket, while Dinesh Karthik's quickfire 30 for RCB had earlier set up a competitive total. \n\nRuturaj Gaikwad’s fluent 82 anchored the chase, while Deepak Chahar’s 3/27 in the powerplay kept RCB in check. \n\nRCB, who won the toss and opted to bat, failed to capitalise on a strong start, with a crucial DRS overturn in the 16th over dismissing Maxwell at a key moment. The dry Chepauk pitch offered turn, aiding CSK’s spinners. \n\nThis win gives CSK early momentum in the tournament, while RCB will look to bounce back in their next clash against KKR."}
{"match_id": 1422120, "report_text": "Mumbai Indians edged out Delhi Capitals by 4 runs in a last-over thriller at Wankhede, defending 188 in a match that went down to the final ball. \n\nTilak Varma and Tim David’s 70-run blitz in the last 4 overs lifted MI to a strong total, but a rapid 62 from Rishabh Pant nearly took DC home. \n\nJasprit Bumrah starred with the ball, claiming 3/29 including two wickets in the penultimate over, while Varma’s 54 off 32 was the batting highlight. \n\nDC had earlier won the toss and bowled first, and successfully reviewed an LBW against Rohit Sharma. A minor injury to David Warner saw him retire hurt midway, hampering DC’s chase. \n\nThe victory moves MI into the top 4 of the points table, setting up a high-stakes clash against CSK next week."}
{"match_id": 1422121, "report_text": "Kolkata Knight Riders powered to an 8-wicket win over Sunrisers Hyderabad in Qualifier 1, booking their spot in the IPL 2024 final. \n\nSRH collapsed from 92/2 to 135 all out after losing 5 wickets for 12 runs, thanks to a superb spell from Sunil Narine. In reply, Venkatesh Iyer’s unbeaten 72 off 45 balls ensured a comfortable chase with 22 balls remaining. \n\nNarine’s 4/18 dismantled SRH’s middle order, while Iyer dominated the chase with clean hitting. \n\nSRH had won the toss and batted on a slow pitch that favoured spin, but an unsuccessful DRS early on cost them their review. \n\nKKR now await the winner of the Eliminator between MI and RCB for the grand finale in Ahmedabad."}
{"match_id": 1422122, "report_text": "Gujarat Titans secured a narrow 3-wicket victory over Rajasthan Royals in a high-scoring encounter at Narendra Modi Stadium. \n\nJos Buttler’s explosive 85 off 45 balls propelled RR to a formidable total of 205, but GT’s middle order held their nerve to chase it down with 2 balls to spare. \n\nSai Sudharsan’s blistering 78 off 40 and Hardik Pandya’s finishing touch with an unbeaten 42 off 20 were crucial in the chase. \n\nRR had earlier won the toss and opted to bat, with Buttler and Sanju Samson (50) providing a solid foundation. However, GT’s bowlers pulled things back in the death overs. \n\nThis win puts GT in a strong position early in the tournament, while RR will look to regroup ahead of their next match against KKR."}