{"match_id":1422123,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/gujarat-titans-vs-mumbai-indians-5th-match-1422123/match-report","summary_text":"Gujarat Titans 168 for 6 (Sudharsan 45, Bumrah 3-14, Coetzee 2-27) beat Mumbai Indians 162 for 9 (Brevis 46, Rohit 43, Mohit 2-32) by six runs. Keep your eyes on Shubman Gill. The captain. With Mumbai Indians on 107 for 2 after 12 overs, chasing 169, he barracked his team to get back in the game. And boy, did they ever. A batting line-up that is the envy of the T20 world came undone even with conditions pretty much in their favour, with two set batters at the crease and dew all over the park. And Titans, who had less than 8% chance of victory, went on to achieve a famous one. Or maybe it isn't. Because they keep doing this. They keep defying the odds. Here they had their former captain - the one who built them into IPL winners - give them a huge scare. Hardik Pandya went 6 and 4 to start the last over when 19 were required. He looked in the mood. His old coach Ashish Nehra, who spent a vast majority of the chase patrolling the boundary, issuing instructions - seemingly spoon-feeding Spencer Johnson what he had to do in a 19th over that produced two of the five wickets that fell in the last 13 balls - turned away. He couldn't watch. But he should have. Because Umesh Yadav, who doesn't really bowl at the death, took full advantage of the two-bouncers-an-over rule and sent one up at Hardik's right ear, which, even with his power, only went as far as the fielder at long-on. Eighty thousand and eighty one people roared in unison. They sensed it. They sensed that yet another incredible win was theirs."}
{"match_id":1422124,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/royal-challengers-bengaluru-vs-punjab-kings-6th-match-1422124/match-report","summary_text":"Royal Challengers Bengaluru 178 for 6 (Kohli 77, Karthik 28*, Brar 2-13, Rabada 2-23) beat Punjab Kings 176 for 6 (Dhawan 45, Jitesh 27, Siraj 2-26, Maxwell 2-29) by four wickets. A Virat Kohli masterclass in a tricky chase at a packed Chinnaswamy Stadium. A last-over thriller. An RCB win. Everything that Royal Challengers Bengaluru fans would have wanted from their team's first home game of the season, they got it. In spades. But, it didn't come without a scare. For the longest time, Kohli - the king of the chase - had things under control. Chasing 177, he had the crowd dancing to his tune as he smashed the Punjab Kings bowlers all around the park for a 49-ball 77. Till he didn't. Harpreet Brar's frugal spell of 2 for 13 after Kagiso Rabada's two-wicket burst in the powerplay had RCB in a bind. The crowd was silenced. Were RCB going to become the first team this IPL to lose a home game? Enter finisher Dinesh Karthik. His bio says he is 38. He is! But you wouldn't believe that seeing him move around the crease, and up and down the pitch. With RCB requiring 47 off 22, Karthik walked in and smoked an unbeaten 28 off ten balls, with three fours and two sixes, to take RCB over the line with four balls to spare."}
{"match_id":1422125,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/chennai-super-kings-vs-gujarat-titans-7th-match-1422125/match-report","summary_text":"Chennai Super Kings 206 for 6 (Dube 51, Ravindra 46) beat Gujarat Titans 143 for 8 (Sudharsan 37, Chahar 2-28, Deshpande 2-21) by 63 runs. The new faces of Chennai Super Kings impressed against the team they took down in the IPL 2023 final, signalling that the post-MS Dhoni era could also be filled with lots of success. Rachin Ravindra (46 off 20), Shivam Dube (51 off 23), Sameer Rizvi (14 off 6) and the captain Ruturaj Gaikwad himself (46 off 36) led them to a total of 206, which proved plenty more than enough for a bowling attack that is also undergoing change. For the second game running, Chepauk offered no wickets to the home team's spinners. Instead, it was the fast bowlers led by Deepak Chahar (2 for 28) and Tushar Deshpande (2 for 21) who did all the damage. The times, they are a'changin."}
{"match_id":1422126,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/sunrisers-hyderabad-vs-mumbai-indians-8th-match-1422126/match-report","summary_text":"Sunrisers Hyderabad 277 for 3 (Klaasen 80*, Abhishek 63, Head 62) beat Mumbai Indians 246 for 5 (Tilak 64, David 42*, Cummins 2-35) by 31 runs. Sixes were being hit for fun. Runs were flowing at a breakneck pace. You wouldn't be blamed for thinking you were watching a video game. The carnage in Hyderabad resulted in an 11-year-old IPL record falling, RCB's seemingly insurmountable total of 263 from 2013 falling by the wayside thanks to a breathtaking, collective show from the Sunrisers Hyderabad batters. They notched up the highest total in the 16-year history of the IPL - 277 for 3 - but then, just as incredibly, Mumbai Indians almost paid them back with the same coin, their batters coming out with a nothing-to-lose attitude. Eventually, they ran out of steam and finished on 246 for 5, the highest IPL total in a losing cause. Travis Head set the pace on the night, striking an 18-ball half-century, the fastest for SRH in the IPL. His record lasted roughly four overs, Abhishek Sharma slamming a 16-ball fifty to relegate him to No. 2. An hour after that, Heinrich Klaasen cut loose to seemingly bat MI out of the contest. But the sixes kept rolling off the Mumbai bats too, helping them keep up with the asking rate for most of the chase, eventually falling only 31 short. Never were more runs scored in a men's T20 match (523). Never were most sixes hit in a men's T20 (38). At the end of the close to four-hour six-fest, only two bowlers returned with an economy rate of under ten an over."}
{"match_id":1422127,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/rajasthan-royals-vs-delhi-capitals-9th-match-1422127/match-report","summary_text":"Rajasthan Royals 185 for 5 (Parag 84, Ashwin 29, Axar 1-21, Khaleel 1-24) beat Delhi Capitals 173 for 5 (Warner 49, Stubbs 44*, Chahal 2-19, Burger 2-29) by 12 runs. On a night that their big three batters managed 31 off 37 between them, Rajasthan Royals overcame a big conditions handicap through what many feel is the coming of age of Riyan Parag. When the ball seamed and swung, accounting for Yashasvi Jaiswal, Sanju Samson and Jos Buttler, Parag played watchfully but turned 16 off 20 into a match-winning 84 off 45. Despite the Parag assault, Delhi Capitals would have felt confident they could chase down 186 what with the dew and reduced seam movement on offer, but Nandre Burger, Royals' Impact Player, made early dents with the ball, Yuzvendra Chahal picked wickets, and Avesh Khan and Sandeep Sharma closed out superbly with yorkers and wide lines."}
{"match_id":1422128,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/royal-challengers-bengaluru-vs-kolkata-knight-riders-10th-match-1422128/match-report","summary_text":"Kolkata Knight Riders 186 for 3 (Venkatesh 50, Narine 47) beat Royal Challengers Bengaluru 182 for 6 (Kohli 83*, Russell 2-29, Rana 2-39) by seven wickets. It took 10 matches for IPL 2024 to produce a victory by the away team. Though it was perhaps predictable that it came at the M Chinnaswamy stadium, where the small ground really does favour the chasing team. That, on Friday, was Kolkata Knight Riders, who overcame a Virat Kohli masterclass to chase down 183 and claim the two points."}
{"match_id":1422129,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/lucknow-super-giants-vs-punjab-kings-11th-match-1422129/match-report","summary_text":"Lucknow Super Giants 199 for 8 (de Kock 54, Krunal 43*, Curran 3-28) beat Punjab Kings 178 for 5 (Dhawan 70, Mayank 3-27, Mohsin 2-34) by 21 runs. Justin Langer has arrived in the IPL. It took just one game of tired old T20 cricket, and the consequent heavy defeat of course, for Lucknow Super Giants to burn that book of conservative T20 cricket and play with much higher intent. As a result they didn't have the ideal players operating in the death overs of each innings, but they had done enough damage in the middle overs on both occasions to win by 21 runs. The 103 that LSG scored in the middle overs is the second-highest in their history; both the efforts featured Nicholas Pooran and Marcus Stoinis batting a higher number of balls unlike in the first match when they were held back for the death overs. With the ball, LSG unleashed Mayank Yadav's extreme pace - highest being 155.8kmph - and awkward bounce to take five wickets for 84. As it turned out, they lost out on some runs in the final few overs and had to bowl Krunal Pandya in the 19th, but the game was over by then. The first step - either made easier by a quad strain or a huge tactical move considering how it is near-impossible to remove Indian captains - was to give the captaincy to Pooran, leaving KL Rahul with just batting responsibilities."}
{"match_id":1422130,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/gujarat-titans-vs-sunrisers-hyderabad-12th-match-1422130/match-report","summary_text":"Gujarat Titans 168 for 3 (Sai Sudharsan 45, Miller 44*, Cummins 1-28) beat Sunrisers Hyderabad 162 for 8 (Samad 29, Abhishek 29, Mohit 3-25, Noor 1-32) by seven wickets. Pat Cummins won the toss in Ahmedabad, but unlike the ODI World Cup final, he did not make the right call as Sunrisers Hyderabad's score of 162 for 8 was comfortably chased by Gujarat Titans in Ahmedabad to make it 11 wins out of 12 for home teams in IPL 2024. Noor Ahmad, Mohit Sharma and former Sunriser Rashid Khan suffocated the big-hitting team in orange to keep them down to a below-par score, and as the surface got better in the evening, the Titans rode on contributions from Shubman Gill, Sai Sudharsan and David Miller to see them through."}
{"match_id":1422131,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/delhi-capitals-vs-chennai-super-kings-13th-match-1422131/match-report","summary_text":"Delhi Capitals 191 for 5 (Warner 52, Pant 51, Shaw 43, Pathirana 3-31) beat Chennai Super Kings 171 for 6 (Rahane 45, Dhoni 37*, Mitchell 34, Mukesh 3-21, Khaleel 2-21) by 20 runs. At approximately 11 on Sunday night, Visakhapatnam came alive. 'Hosts' Delhi Capitals were on their way to their first win, but the result suddenly seemed irrelevant. Super Kings needed 41 off six. Impossible if extras didn't come into it. That was no reason for the crowd to stop. Dhoni was on strike. They wanted him to turn the clock back. And he did, walloping Anrich Nortje for two fours and two sixes. Dhoni finished 37 not out off 16, Super Kings fell short by 20 runs, but you couldn't quite say if the fans in yellow were disappointed at the result or ecstatic at watching their hero do his thing. After he scythed a full-toss for six to finish the game, the realisation dawned that the Capitals had picked up their first win of the season, a result set up by David Warner and Rishabh Pant with the bat, and finished off by Khaleel and Mukesh."}
{"match_id":1422132,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/mumbai-indians-vs-rajasthan-royals-14th-match-1422132/match-report","summary_text":"Rajasthan Royals 127 for 4 (Parag 54*, Madhwal 3-20) beat Mumbai Indians 125 for 9 (Hardik 34, Tilak 32, Chahal 3-11, Boult 3-22, Burger 2-32) by six wickets. Hardik Pandya's return to the Wankhede Stadium as Mumbai Indians captain was far from a fairy tale, as the five-time champions lost their third game in a row, this time with 27 balls to spare. Rajasthan Royals - led by superb performances from Trent Boult, Yuzvendra Chahal and Riyan Parag - gave them a thorough hammering to move to No. 1 on the points table with a hat-trick of victories. Boult left Mumbai gasping within minutes of the start of the match when he dismissed Rohit Sharma, Naman Dhir and Dewald Brevis for first-ball ducks in his first eight balls. His 3 for 22 was only matched by the 3 for 11 taken by Chahal, who controlled the middle overs to ensure Mumbai did not stage a batting comeback. Chasing 126 for victory, Parag dragged Royals out of some early trouble and shepherded the chase. He finished the game with six, six, and four to stay unbeaten on 54 to take the No. 1 spot on the orange cap leaderboard - tied on runs with Virat Kohli but ahead of strike rate."}
{"match_id":1422133,"source":"espncricinfo","url":"https://www.espncricinfo.com/series/indian-premier-league-2024-1410320/royal-challengers-bengaluru-vs-lucknow-super-giants-15th-match-1422133/match-report","summary_text":"Lucknow Super Giants 181 for 5 (De Kock 81, Pooran 40*, Maxwell 2-23) beat Royal Challengers Bengaluru 153 (Lomror 33, Mayank 3-14, Naveen 2-25) by 28 runs. Mayank Yadav set the speed gun on fire once again and ripped out Glenn Maxwell and Cameron Green on his way to figures of 4-0-14-3 as Lucknow Super Giants successfully defended 181 to hand Royal Challengers Bengaluru their second successive defeat at the M Chinnaswamy Stadium. It was Quinton de Kock who laid the base for LSG's victory with his second successive half-century. KL Rahul returned to action as their captain but he could only manage 20 off 14 balls. But Nicholas Pooran, who had captained LSG in their last game against Punjab Kings, clicked into a higher gear, smashing an unbeaten 40 off 21 balls to drag his team past 180 on a two-paced pitch. The back-of-the-hand slower balls from Reece Topley and Yash Dayal were sticking in the surface, but Mayank doesn't do slow. He repeatedly breached 150kph - and even cranked it up to a season-high 156.7kph - to shut down RCB's chase."}